webservers/results.txt
------------------------------------------------------------------------------------------------------------
---                       GIN ROUTER
------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------
---                       1 Connection
------------------------------------------------------------------------------------------------------------		   

go run autocannon.go -uri=http://localhost:3000 -connections=1 -pipelining=8
running 10s test @ http://localhost:3000

1 connections with 8 pipelining factor.

+---------+------+------+-------+------+---------+---------+--------+
|  STAT   | 2.5% | 50%  | 97.5% | 99%  |   AVG   |  STDEV  |  MAX   |
+---------+------+------+-------+------+---------+---------+--------+
| Latency | 1 ms | 1 ms | 3 ms  | 4 ms | 1.48 ms | 2.83 ms | 173 ms |
+---------+------+------+-------+------+---------+---------+--------+


+-----------+--------+--------+--------+--------+---------+--------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG   | STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+---------+--------+--------+
| Req/Sec   |   2978 |   2978 |   4130 |   4468 | 4014.67 | 473.21 |   2978 |
| Bytes/Sec | 354 kB | 354 kB | 492 kB | 532 kB | 478 kB  | 56 kB  | 354 kB |
+-----------+--------+--------+--------+--------+---------+--------+--------+
                                                                             


Req/Bytes counts sampled once per second.


40225 2xx responses, 0 non 2xx responses.
40k total requests in 10 seconds, 4.8 MB read.


------------------------------------------------------------------------------------------------------------
---                       64 Connections
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3000 -connections=64 -pipelining=8
running 10s test @ http://localhost:3000

64 connections with 8 pipelining factor.
                         
+---------+--------+--------+--------+--------+-----------+----------+--------+
|  STAT   |  2.5%  |  50%   | 97.5%  |  99%   |    AVG    |  STDEV   |  MAX   |
+---------+--------+--------+--------+--------+-----------+----------+--------+
| Latency | 101 ms | 139 ms | 250 ms | 349 ms | 146.34 ms | 40.20 ms | 388 ms |
+---------+--------+--------+--------+--------+-----------+----------+--------+


+-----------+--------+--------+--------+--------+---------+--------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG   | STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+---------+--------+--------+
| Req/Sec   |   2562 |   2562 |   3530 |   3953 | 3448.70 | 413.71 |   2562 |
| Bytes/Sec | 305 kB | 305 kB | 420 kB | 470 kB | 410 kB  | 49 kB  | 305 kB |
+-----------+--------+--------+--------+--------+---------+--------+--------+

Req/Bytes counts sampled once per second.


34487 2xx responses, 0 non 2xx responses.
34k total requests in 10 seconds, 4.1 MB read.


------------------------------------------------------------------------------------------------------------
---                       CHI ROUTER
------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------
---                       1 Connection
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3001 -connections=1 -pipelining=8
running 10s test @ http://localhost:3001

1 connections with 8 pipelining factor.
                       
+---------+------+------+-------+------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% | 99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+------+---------+---------+-------+
| Latency | 0 ms | 0 ms | 0 ms  | 0 ms | 0.02 ms | 0.26 ms | 15 ms |
+---------+------+------+-------+------+---------+---------+-------+


+-----------+--------+--------+--------+--------+----------+---------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG    |  STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+----------+---------+--------+
| Req/Sec   |  32115 |  32115 |  35354 |  38323 | 35679.40 | 2167.72 |  32115 |
| Bytes/Sec | 3.8 MB | 3.8 MB | 4.2 MB | 4.6 MB | 4.2 MB   | 258 kB  | 3.8 MB |
+-----------+--------+--------+--------+--------+----------+---------+--------+

Req/Bytes counts sampled once per second.


356794 2xx responses, 0 non 2xx responses.
357k total requests in 10 seconds, 42 MB read.


------------------------------------------------------------------------------------------------------------
---                       64 Connections
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3001 -connections=64 -pipelining=8
running 10s test @ http://localhost:3001

64 connections with 8 pipelining factor.
                         

+---------+------+------+-------+-------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% |  99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+-------+---------+---------+-------+
| Latency | 0 ms | 3 ms | 11 ms | 14 ms | 3.77 ms | 3.21 ms | 61 ms |
+---------+------+------+-------+-------+---------+---------+-------+


+-----------+-------+-------+--------+--------+-----------+----------+-------+
|   STAT    |  1%   | 2.5%  |  50%   | 97.5%  |    AVG    |  STDEV   |  MIN  |
+-----------+-------+-------+--------+--------+-----------+----------+-------+
| Req/Sec   | 96461 | 96461 | 117602 | 144127 | 119644.22 | 17064.17 | 96461 |
| Bytes/Sec | 12 MB | 12 MB | 14 MB  | 17 MB  | 14 MB     | 2.0 MB   | 12 MB |
+-----------+-------+-------+--------+--------+-----------+----------+-------+

Req/Bytes counts sampled once per second.


1220567 2xx responses, 0 non 2xx responses.
1221k total requests in 10 seconds, 145 MB read.


------------------------------------------------------------------------------------------------------------
---                       AIRBORNE (Gustavo Sainz router/webserver ---  Not yet released 
------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------
---                       1 Connection
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3002 -connections=1 -pipelining=8
running 10s test @ http://localhost:3002

1 connections with 8 pipelining factor.
                                                                    
                                                                    
+---------+------+------+-------+------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% | 99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+------+---------+---------+-------+
| Latency | 0 ms | 0 ms | 0 ms  | 1 ms | 0.03 ms | 0.37 ms | 15 ms |
+---------+------+------+-------+------+---------+---------+-------+


+-----------+--------+--------+--------+--------+----------+---------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG    |  STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+----------+---------+--------+
| Req/Sec   |  25633 |  25633 |  36069 |  37209 | 34771.30 | 3295.66 |  25633 |
| Bytes/Sec | 3.1 MB | 3.1 MB | 4.3 MB | 4.4 MB | 4.1 MB   | 392 kB  | 3.1 MB |
+-----------+--------+--------+--------+--------+----------+---------+--------+

Req/Bytes counts sampled once per second.


347713 2xx responses, 0 non 2xx responses.
348k total requests in 10 seconds, 41 MB read.


------------------------------------------------------------------------------------------------------------
---                       64 Connections
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3002 -connections=64 -pipelining=8
running 10s test @ http://localhost:3002

64 connections with 8 pipelining factor.

+---------+------+------+-------+-------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% |  99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+-------+---------+---------+-------+
| Latency | 0 ms | 3 ms | 8 ms  | 10 ms | 3.06 ms | 2.39 ms | 45 ms |
+---------+------+------+-------+-------+---------+---------+-------+


+-----------+--------+--------+--------+--------+-----------+----------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |    AVG    |  STDEV   |  MIN   |
+-----------+--------+--------+--------+--------+-----------+----------+--------+
| Req/Sec   | 126581 | 126581 | 149001 | 157197 | 146884.40 | 11149.77 | 126581 |
| Bytes/Sec | 15 MB  | 15 MB  | 18 MB  | 19 MB  | 18 MB     | 1.3 MB   | 15 MB  |
+-----------+--------+--------+--------+--------+-----------+----------+--------+

Req/Bytes counts sampled once per second.


1468844 2xx responses, 0 non 2xx responses.
1469k total requests in 10 seconds, 175 MB read.

------------------------------------------------------------------------------------------------------------
---                       ECHO
------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------
---                       1 Connection
------------------------------------------------------------------------------------------------------------
go run autocannon.go -uri=http://localhost:3003 -connections=1 -pipelining=8
running 10s test @ http://localhost:3003
1 connections with 8 pipelining factor.


+---------+------+------+-------+------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% | 99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+------+---------+---------+-------+
| Latency | 0 ms | 0 ms | 0 ms  | 1 ms | 0.03 ms | 0.34 ms | 13 ms |
+---------+------+------+-------+------+---------+---------+-------+


+-----------+--------+--------+--------+--------+----------+---------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG    |  STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+----------+---------+--------+
| Req/Sec   |  28951 |  28951 |  37051 |  39225 | 36237.44 | 3029.04 |  28951 |
| Bytes/Sec | 3.4 MB | 3.4 MB | 4.3 MB | 4.6 MB | 4.2 MB   | 351 kB  | 3.4 MB |
+-----------+--------+--------+--------+--------+----------+---------+--------+

Req/Bytes counts sampled once per second.


363394 2xx responses, 0 non 2xx responses.
363k total requests in 10 seconds, 42 MB read.

------------------------------------------------------------------------------------------------------------
---                       64 Connections
------------------------------------------------------------------------------------------------------------
go run autocannon.go -uri=http://localhost:3003 -connections=64 -pipelining=8
running 10s test @ http://localhost:3003
64 connections with 8 pipelining factor.


+---------+------+------+-------+-------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% |  99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+-------+---------+---------+-------+
| Latency | 0 ms | 4 ms | 11 ms | 13 ms | 3.87 ms | 2.98 ms | 51 ms |
+---------+------+------+-------+-------+---------+---------+-------+


+-----------+-------+-------+--------+--------+-----------+---------+-------+
|   STAT    |  1%   | 2.5%  |  50%   | 97.5%  |    AVG    |  STDEV  |  MIN  |
+-----------+-------+-------+--------+--------+-----------+---------+-------+
| Req/Sec   | 98362 | 98362 | 119245 | 132757 | 118637.60 | 9092.90 | 98362 |
| Bytes/Sec | 11 MB | 11 MB | 14 MB  | 15 MB  | 14 MB     | 1.1 MB  | 11 MB |
+-----------+-------+-------+--------+--------+-----------+---------+-------+

Req/Bytes counts sampled once per second.


1186377 2xx responses, 0 non 2xx responses.
1186k total requests in 10 seconds, 138 MB read.

------------------------------------------------------------------------------------------------------------
---                       NODE
------------------------------------------------------------------------------------------------------------

------------------------------------------------------------------------------------------------------------
---                       1 Connection
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3004 -connections=1 -pipelining=8
running 10s test @ http://localhost:3004
1 connections with 8 pipelining factor.


+---------+------+------+-------+------+---------+---------+-------+
|  STAT   | 2.5% | 50%  | 97.5% | 99%  |   AVG   |  STDEV  |  MAX  |
+---------+------+------+-------+------+---------+---------+-------+
| Latency | 0 ms | 1 ms | 2 ms  | 3 ms | 0.85 ms | 1.11 ms | 32 ms |
+---------+------+------+-------+------+---------+---------+-------+


+-----------+--------+--------+--------+--------+---------+--------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG   | STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+---------+--------+--------+
| Req/Sec   |   3527 |   3527 |   6206 |   6803 | 5978.11 | 935.11 |   3527 |
| Bytes/Sec | 744 kB | 744 kB | 1.3 MB | 1.4 MB | 1.3 MB  | 197 kB | 744 kB |
+-----------+--------+--------+--------+--------+---------+--------+--------+

Req/Bytes counts sampled once per second.


59751 2xx responses, 0 non 2xx responses.
60k total requests in 10 seconds, 13 MB read.

------------------------------------------------------------------------------------------------------------
---                       64 Connections
------------------------------------------------------------------------------------------------------------

go run autocannon.go -uri=http://localhost:3004 -connections=64 -pipelining=8
running 10s test @ http://localhost:3004
64 connections with 8 pipelining factor.


+---------+-------+-------+--------+--------+----------+----------+--------+
|  STAT   | 2.5%  |  50%  | 97.5%  |  99%   |   AVG    |  STDEV   |  MAX   |
+---------+-------+-------+--------+--------+----------+----------+--------+
| Latency | 67 ms | 82 ms | 132 ms | 142 ms | 86.94 ms | 18.38 ms | 240 ms |
+---------+-------+-------+--------+--------+----------+----------+--------+


+-----------+--------+--------+--------+--------+---------+--------+--------+
|   STAT    |   1%   |  2.5%  |  50%   | 97.5%  |   AVG   | STDEV  |  MIN   |
+-----------+--------+--------+--------+--------+---------+--------+--------+
| Req/Sec   |   4183 |   4183 |   6063 |   6353 | 5724.67 | 716.66 |   4183 |
| Bytes/Sec | 883 kB | 883 kB | 1.3 MB | 1.3 MB | 1.2 MB  | 151 kB | 883 kB |
+-----------+--------+--------+--------+--------+---------+--------+--------+

Req/Bytes counts sampled once per second.


58416 2xx responses, 0 non 2xx responses.
58k total requests in 10 seconds, 12 MB read.